inference/load_testing/vegeta/fastapi/classification/llama_13B/a100/results1.txt
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             2.527s, 0s, 2.527s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.527s, 2.527s, 2.527s, 2.527s, 2.527s, 2.527s, 2.527s
Bytes In      [total, mean]                     17, 17.00
Bytes Out     [total, mean]                     512, 512.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             432.293ms, 0s, 432.293ms
Latencies     [min, mean, 50, 90, 95, 99, max]  432.293ms, 432.293ms, 432.293ms, 432.293ms, 432.293ms, 432.293ms, 432.293ms
Bytes In      [total, mean]                     17, 17.00
Bytes Out     [total, mean]                     579, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             429.429ms, 0s, 429.429ms
Latencies     [min, mean, 50, 90, 95, 99, max]  429.429ms, 429.429ms, 429.429ms, 429.429ms, 429.429ms, 429.429ms, 429.429ms
Bytes In      [total, mean]                     17, 17.00
Bytes Out     [total, mean]                     579, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 1.15
Duration      [total, attack, wait]             1.741s, 499.996ms, 1.241s
Latencies     [min, mean, 50, 90, 95, 99, max]  398.037ms, 1.069s, 1.069s, 1.741s, 1.741s, 1.741s, 1.741s
Bytes In      [total, mean]                     34, 17.00
Bytes Out     [total, mean]                     1040, 520.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 2.23
Duration      [total, attack, wait]             895.366ms, 499.957ms, 395.409ms
Latencies     [min, mean, 50, 90, 95, 99, max]  395.409ms, 416.808ms, 416.808ms, 438.206ms, 438.206ms, 438.206ms, 438.206ms
Bytes In      [total, mean]                     34, 17.00
Bytes Out     [total, mean]                     1158, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 2.42
Duration      [total, attack, wait]             825.543ms, 499.935ms, 325.608ms
Latencies     [min, mean, 50, 90, 95, 99, max]  325.608ms, 349.199ms, 349.199ms, 372.79ms, 372.79ms, 372.79ms, 372.79ms
Bytes In      [total, mean]                     34, 17.00
Bytes Out     [total, mean]                     1028, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 2.44
Duration      [total, attack, wait]             1.228s, 666.621ms, 561.376ms
Latencies     [min, mean, 50, 90, 95, 99, max]  534.331ms, 585.612ms, 561.376ms, 661.13ms, 661.13ms, 661.13ms, 661.13ms
Bytes In      [total, mean]                     51, 17.00
Bytes Out     [total, mean]                     1737, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 2.99
Duration      [total, attack, wait]             1.002s, 666.727ms, 335.452ms
Latencies     [min, mean, 50, 90, 95, 99, max]  335.452ms, 349.148ms, 348.086ms, 363.907ms, 363.907ms, 363.907ms, 363.907ms
Bytes In      [total, mean]                     51, 17.00
Bytes Out     [total, mean]                     1548, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 2.94
Duration      [total, attack, wait]             1.019s, 666.698ms, 352.241ms
Latencies     [min, mean, 50, 90, 95, 99, max]  352.241ms, 378.978ms, 382.825ms, 401.867ms, 401.867ms, 401.867ms, 401.867ms
Bytes In      [total, mean]                     51, 17.00
Bytes Out     [total, mean]                     1542, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         4, 5.33, 2.85
Duration      [total, attack, wait]             1.405s, 749.954ms, 654.575ms
Latencies     [min, mean, 50, 90, 95, 99, max]  476.007ms, 674.745ms, 704.432ms, 814.109ms, 814.109ms, 814.109ms, 814.109ms
Bytes In      [total, mean]                     68, 17.00
Bytes Out     [total, mean]                     2056, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4
Error Set:
Requests      [total, rate, throughput]         4, 5.33, 2.86
Duration      [total, attack, wait]             1.397s, 749.918ms, 646.922ms
Latencies     [min, mean, 50, 90, 95, 99, max]  457.2ms, 647.746ms, 678.804ms, 776.179ms, 776.179ms, 776.179ms, 776.179ms
Bytes In      [total, mean]                     68, 17.00
Bytes Out     [total, mean]                     2048, 512.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4
Error Set:
Requests      [total, rate, throughput]         4, 5.33, 2.85
Duration      [total, attack, wait]             1.401s, 749.999ms, 651.083ms
Latencies     [min, mean, 50, 90, 95, 99, max]  461.914ms, 657.344ms, 681.167ms, 805.129ms, 805.129ms, 805.129ms, 805.129ms
Bytes In      [total, mean]                     68, 17.00
Bytes Out     [total, mean]                     2080, 520.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:4
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 3.07
Duration      [total, attack, wait]             1.626s, 799.84ms, 826.524ms
Latencies     [min, mean, 50, 90, 95, 99, max]  523.736ms, 839.138ms, 893.072ms, 1.003s, 1.003s, 1.003s, 1.003s
Bytes In      [total, mean]                     85, 17.00
Bytes Out     [total, mean]                     2580, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 3.06
Duration      [total, attack, wait]             1.632s, 799.922ms, 832.238ms
Latencies     [min, mean, 50, 90, 95, 99, max]  523.496ms, 841.764ms, 892.16ms, 1.001s, 1.001s, 1.001s, 1.001s
Bytes In      [total, mean]                     85, 17.00
Bytes Out     [total, mean]                     2580, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 2.96
Duration      [total, attack, wait]             1.689s, 800.04ms, 889.162ms
Latencies     [min, mean, 50, 90, 95, 99, max]  662.673ms, 891.007ms, 889.162ms, 1.16s, 1.16s, 1.16s, 1.16s
Bytes In      [total, mean]                     85, 17.00
Bytes Out     [total, mean]                     2570, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         6, 7.20, 2.96
Duration      [total, attack, wait]             2.024s, 833.231ms, 1.19s
Latencies     [min, mean, 50, 90, 95, 99, max]  720.476ms, 1.19s, 1.266s, 1.468s, 1.469s, 1.469s, 1.469s
Bytes In      [total, mean]                     102, 17.00
Bytes Out     [total, mean]                     3072, 512.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:6
Error Set:
Requests      [total, rate, throughput]         6, 7.20, 2.95
Duration      [total, attack, wait]             2.036s, 833.346ms, 1.203s
Latencies     [min, mean, 50, 90, 95, 99, max]  727.662ms, 1.187s, 1.327s, 1.506s, 1.51s, 1.51s, 1.51s
Bytes In      [total, mean]                     102, 17.00
Bytes Out     [total, mean]                     3120, 520.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:6
Error Set:
Requests      [total, rate, throughput]         6, 7.20, 2.81
Duration      [total, attack, wait]             2.132s, 833.33ms, 1.299s
Latencies     [min, mean, 50, 90, 95, 99, max]  547.937ms, 1.338s, 1.42s, 1.746s, 1.758s, 1.758s, 1.758s
Bytes In      [total, mean]                     102, 17.00
Bytes Out     [total, mean]                     3096, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:6
Error Set:
Requests      [total, rate, throughput]         7, 8.17, 2.80
Duration      [total, attack, wait]             2.501s, 857.123ms, 1.644s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.154s, 1.608s, 1.644s, 2.041s, 2.051s, 2.051s, 2.051s
Bytes In      [total, mean]                     119, 17.00
Bytes Out     [total, mean]                     3759, 537.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:7
Error Set:
Requests      [total, rate, throughput]         7, 8.17, 2.80
Duration      [total, attack, wait]             2.496s, 857.098ms, 1.639s
Latencies     [min, mean, 50, 90, 95, 99, max]  943.984ms, 1.643s, 1.747s, 1.904s, 1.913s, 1.913s, 1.913s
Bytes In      [total, mean]                     119, 17.00
Bytes Out     [total, mean]                     3640, 520.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:7
Error Set:
Requests      [total, rate, throughput]         7, 8.17, 2.85
Duration      [total, attack, wait]             2.458s, 857.207ms, 1.601s
Latencies     [min, mean, 50, 90, 95, 99, max]  725.347ms, 1.541s, 1.744s, 1.991s, 2.004s, 2.004s, 2.004s
Bytes In      [total, mean]                     119, 17.00
Bytes Out     [total, mean]                     3598, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:7
Error Set:
Requests      [total, rate, throughput]         8, 9.14, 2.80
Duration      [total, attack, wait]             2.856s, 875.054ms, 1.981s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.377s, 1.955s, 2.098s, 2.232s, 2.247s, 2.247s, 2.247s
Bytes In      [total, mean]                     136, 17.00
Bytes Out     [total, mean]                     4112, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:8
Error Set:
Requests      [total, rate, throughput]         8, 9.14, 2.91
Duration      [total, attack, wait]             2.753s, 875.001ms, 1.878s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.163s, 1.804s, 1.986s, 2.237s, 2.249s, 2.249s, 2.249s
Bytes In      [total, mean]                     136, 17.00
Bytes Out     [total, mean]                     4096, 512.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:8
Error Set:
Requests      [total, rate, throughput]         8, 9.14, 2.32
Duration      [total, attack, wait]             3.446s, 874.978ms, 2.571s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.052s, 2.529s, 2.464s, 2.973s, 3.002s, 3.002s, 3.002s
Bytes In      [total, mean]                     136, 17.00
Bytes Out     [total, mean]                     4632, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:8
Error Set:
Requests      [total, rate, throughput]         9, 10.12, 2.80
Duration      [total, attack, wait]             3.216s, 889.014ms, 2.327s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.318s, 2.282s, 2.258s, 2.805s, 2.817s, 2.817s, 2.817s
Bytes In      [total, mean]                     153, 17.00
Bytes Out     [total, mean]                     4644, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:9
Error Set:
Requests      [total, rate, throughput]         9, 10.12, 2.82
Duration      [total, attack, wait]             3.192s, 888.909ms, 2.303s
Latencies     [min, mean, 50, 90, 95, 99, max]  933.807ms, 2.23s, 2.414s, 2.594s, 2.601s, 2.601s, 2.601s
Bytes In      [total, mean]                     153, 17.00
Bytes Out     [total, mean]                     4833, 537.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:9
Error Set:
Requests      [total, rate, throughput]         9, 10.12, 2.84
Duration      [total, attack, wait]             3.173s, 888.994ms, 2.284s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.361s, 2.188s, 2.284s, 2.608s, 2.624s, 2.624s, 2.624s
Bytes In      [total, mean]                     153, 17.00
Bytes Out     [total, mean]                     4644, 516.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:9
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 2.29
Duration      [total, attack, wait]             4.366s, 899.966ms, 3.466s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.348s, 3.382s, 3.458s, 3.786s, 3.795s, 3.795s, 3.795s
Bytes In      [total, mean]                     170, 17.00
Bytes Out     [total, mean]                     5790, 579.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 2.80
Duration      [total, attack, wait]             3.576s, 899.984ms, 2.676s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.793s, 2.646s, 2.786s, 2.907s, 2.918s, 2.918s, 2.918s
Bytes In      [total, mean]                     170, 17.00
Bytes Out     [total, mean]                     5370, 537.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 2.86
Duration      [total, attack, wait]             3.499s, 900.028ms, 2.599s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.224s, 2.43s, 2.399s, 3.029s, 3.034s, 3.034s, 3.034s
Bytes In      [total, mean]                     170, 17.00
Bytes Out     [total, mean]                     5140, 514.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10
Error Set: